fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// Переопределяет настройки печати для объекта.
    //
    // Параметры:
    //  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
    //
Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
	
	//++ a.demeshchenko 01.01.2025 netology Дипломный проект	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект
	
КонецПроцедуры

// Заполняет список команд печати.
    // 
    // Параметры:
    //   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
    //
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//++ a.demeshchenko 01.01.2025 netology Дипломный проект
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Акт";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказаний услуг'");
	КомандаПечати.Порядок = 5;
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект

		
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//++ a.demeshchenko 01.01.2025 netology Дипломный проект
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Акт");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьАкта(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт об оказаний услуг'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ПФ_MXL_Акт";
	КонецЕсли;
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Акт";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_Акт");
	
	ДанныеДокументов = ПолучитьДанныеДокументовДляАктов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВывестиЗаголовокАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
		ВывестиРеквизитыАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
		ВывестиТовары(ДанныеДокументов, ТабличныйДокумент, Макет);
		ВывестиПодвалАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
	
		// В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);
            
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
	//++ a.demeshchenko 01.01.2025 netology Дипломный проект
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Акт";
//	
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_Акт1");
//	
//	ДанныеДокументов = ПолучитьДанныеДокументовДляАктов(МассивОбъектов);
//	
//	ПервыйДокумент = Истина;
//	
//	Пока ДанныеДокументов.Следующий() Цикл
//		
//		Если Не ПервыйДокумент Тогда
//			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//		КонецЕсли;
//		
//		ПервыйДокумент = Ложь;
//		
//		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
//		
//		ВывестиЗаголовокАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
//		
//		ВывестиРеквизитыАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
//		
//		ВывестиТовары(ДанныеДокументов, ТабличныйДокумент, Макет);
//
//		
//		ВывестиПодвалАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
//
//		// В табличном документе необходимо задать имя области, в которую был 
//        // выведен объект. Нужно для возможности печати комплектов документов.
//        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
//            НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов);		
//		
//	КонецЦикла;	
//		
//	Возврат ТабличныйДокумент;
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект
	
КонецФункции

Функция ПолучитьДанныеДокументовДляАктов(МассивОбъектов)
	
	//++ a.demeshchenko 01.01.2025 netology Дипломный проект
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Дата,
		|	РеализацияТоваровУслуг.Номер,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслуг.Организация) КАК Организация,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслуг.Контрагент) КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслуг.Договор) КАК Договор,
		|	РеализацияТоваровУслуг.Товары.(
		|		Номенклатура,
		|		Количество,
		|		Цена,
		|		Сумма),
		|	РеализацияТоваровУслуг.Услуги.(
		|		Номенклатура,
		|		Количество,
		|		Цена,
		|		Сумма),
		|	РеализацияТоваровУслуг.СуммаДокумента,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслуг.Ответственный) КАК Ответственный,
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка В (&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выбрать();
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект
	
КонецФункции

Процедура ВывестиЗаголовокАкта(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	//++ a.demeshchenko 01.01.2025 netology Дипломный проект
	ОбластьЗаголовокАкта = Макет.ПолучитьОбласть("Заголовок");
	
	ОбластьЗаголовокАкта.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ДанныеДокументов.Номер);
	ОбластьЗаголовокАкта.Параметры.ДатаДокумента = Формат(ДанныеДокументов.Дата, "ДФ=dd.MM.yyyy;");
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовокАкта);
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект
	
КонецПроцедуры

Процедура ВывестиРеквизитыАкта(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	//++ a.demeshchenko 01.01.2025 netology Дипломный проект
	ОбластьРеквитизы = Макет.ПолучитьОбласть("Реквизиты");
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Контрагент", ДанныеДокументов.Контрагент);
	ДанныеПечати.Вставить("Организация", ДанныеДокументов.Организация);
	ДанныеПечати.Вставить("Договор", ДанныеДокументов.Договор);
	
	ОбластьРеквитизы.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьРеквитизы);
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект
	
КонецПроцедуры

Процедура ВывестиТовары(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	//++ a.demeshchenko 01.01.2025 netology Дипломный проект
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("ТоварыСтрока");
	ОбластьИтого = Макет.ПолучитьОбласть("Итог");
	
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаТовары = ДанныеДокументов.Товары.Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаТовары);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ВыборкаУслуги = ДанныеДокументов.Услуги.Выбрать();
	Пока ВыборкаУслуги.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаУслуги);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("СуммаДокумента", ДанныеДокументов.СуммаДокумента);
	ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
	
	ТабличныйДокумент.Вывести(ОбластьИтого);
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект
	
КонецПроцедуры

Процедура ВывестиПодвалАкта(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	//++ a.demeshchenko 01.01.2025 netology Дипломный проект
	ОбластьПодвалСчета = Макет.ПолучитьОбласть("Подвал");
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Ответственный", ДанныеДокументов.Ответственный);
	ОбластьПодвалСчета.Параметры.Заполнить(ДанныеПечати);
	
	ТабличныйДокумент.Вывести(ОбластьПодвалСчета);
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
